In [1]:
import pandas as pd
df = pd.read_csv('salaries_by_college_major.csv')

In [2]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [4]:
df.shape

(51, 6)

In [5]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [21]:
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [16]:
print(clean_df["Mid-Career Median Salary"].max())
clean_df["Undergraduate Major"].loc[clean_df["Mid-Career Median Salary"].idxmax()]

107000.0

'Chemical Engineering'

In [17]:
print(clean_df["Starting Median Salary"].min())
clean_df["Undergraduate Major"].loc[clean_df["Starting Median Salary"].idxmin()]

34000.0

'Spanish'

In [14]:
clean_df.loc[clean_df["Mid-Career Median Salary"].idxmin()]

Undergraduate Major                  Education
Starting Median Salary                 34900.0
Mid-Career Median Salary               52000.0
Mid-Career 10th Percentile Salary      29300.0
Mid-Career 90th Percentile Salary     102000.0
Group                                     HASS
Name: 18, dtype: object

In [22]:
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(5, 'Spread', spread_col)
clean_df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Spread,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,109800.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,96700.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,113700.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,104200.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,85400.0,Business

In [33]:
highest_potential = clean_df.sort_values(by=['Mid-Career 90th Percentile Salary'], ascending=False)
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary', 'Spread']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary    Spread
17             Economics                           210000.0  159400.0
22               Finance                           195000.0  147800.0
8   Chemical Engineering                           194000.0  122100.0
37                  Math                           183000.0  137800.0
44               Physics                           178000.0  122000.0

In [34]:
highest_spread = clean_df.sort_values(by=['Spread'], ascending=False)
highest_spread[['Undergraduate Major', 'Mid-Career 90th Percentile Salary', 'Spread']].head()

   Undergraduate Major  Mid-Career 90th Percentile Salary    Spread
17           Economics                           210000.0  159400.0
22             Finance                           195000.0  147800.0
37                Math                           183000.0  137800.0
36           Marketing                           175000.0  132900.0
42          Philosophy                           168000.0  132500.0

In [35]:
pd.options.display.float_format = '{:,.2f}'.format
clean_df.groupby('Group').mean()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Spread
Group,,,,,
Business,"44,633.33","75,083.33","43,566.67","147,525.00","103,958.33"
HASS,"37,186.36","62,968.18","34,145.45","129,363.64","95,218.18"
STEM,"53,862.50","90,812.50","56,025.00","157,625.00","101,600.00"